{
    "films": [
        {
            "id": 1,
            "name": "Gladiador",
            "img": "https://raw.githubusercontent.com/MrFigaro/moviecatalog/main/movieimg/00Gladiator.jpg",
            "genero": [
                "Acción",
                "Drama"
            ],
            "year": 2000,
            "duration": "2h 35min",
            "director": "Ridley Scott",
            "description": "Un antiguo general romano se convierte en gladiador y lucha por vengarse del emperador que asesinó a su familia y lo condenó a la esclavitud. En medio de la lucha por su propia supervivencia, este valiente guerrero descubre la importancia de la lealtad y la amistad, mientras se enfrenta a sus demonios internos y a la crueldad de la sociedad romana."
        },
        {
            "id": 2,
            "name": "Una mente brillante",
            "img": "https://raw.githubusercontent.com/MrFigaro/moviecatalog/main/movieimg/01ABeautifulMind.jpg",
            "genero": [
                "Drama",
                "Biográfica"
            ],
            "year": 2001,
            "duration": "2h 15min",
            "director": "Ron Howard",
            "description": "La historia del matemático John Nash, quien lucha contra la esquizofrenia mientras trata de hacer un importante descubrimiento matemático. A pesar de los obstáculos que enfrenta, Nash persevera en su búsqueda del conocimiento, y su historia nos muestra la fuerza del espíritu humano para superar las adversidades y lograr la grandeza."
        },
        {
            "id": 3,
            "name": "Chicago",
            "img": "https://raw.githubusercontent.com/MrFigaro/moviecatalog/main/movieimg/02Chicago.jpg",
            "genero": [
                "Comedia",
                "Crimen",
                "Musical"
            ],
            "year": 2002,
            "duration": "1h 53min",
            "director": "Rob Marshall",
            "description": "Una mujer acusada de asesinato se convierte en una celebridad cuando un abogado astuto la transforma en una sensación mediática. Este musical lleno de energía y ritmo nos lleva a través de una trama llena de giros y sorpresas, donde la música y el baile son la clave para entender los deseos ocultos de los personajes y sus motivaciones."
        },
        {
            "id": 4,
            "name": "El Señor de los Anillos: El retorno del Rey",
            "img": "https://raw.githubusercontent.com/MrFigaro/moviecatalog/main/movieimg/03ElSeñordelosAnillosElretornodelRey.jpg",
            "genero": [
                "Acción",
                "Aventura",
                "Fantasía"
            ],
            "year": 2003,
            "duration": "3h 21min",
            "director": "Peter Jackson",
            "description": "El último enfrentamiento entre las fuerzas del bien y del mal en la Tierra Media, mientras Frodo y Sam acercan el Anillo al corazón de Mordor. Esta épica aventura nos lleva a través de paisajes espectaculares y personajes inolvidables, donde el valor y la lealtad son las armas más poderosas para enfrentar el mal que amenaza el mundo."
        },
        {
            "id": 5,
            "name": "Million Dollar Baby",
            "img": "https://raw.githubusercontent.com/MrFigaro/moviecatalog/main/movieimg/04MillionDollarBaby.jpg",
            "genero": [
                "Drama",
                "Deportes"
            ],
            "year": 2004,
            "duration": "2h 12min",
            "director": "Clint Eastwood",
            "description": "Una joven boxeadora se entrena con un veterano entrenador para alcanzar la cima en el mundodel boxeo. A pesar de los obstáculos que encuentra en su camino, esta valiente mujer encuentra en el boxeo una forma de superar sus limitaciones y de luchar por sus sueños. Esta conmovedora historia nos muestra la fuerza del espíritu humano para superar los obstáculos y lograr la grandeza."
        }
    ]
}
